test/stress.yml
config:
  target: "http://run:3000"
  phases:
    - duration: 10
      arrivalRate: 1
  processor: "../helper/faker.js"

scenarios:
  - name: "Register a user"
    flow:
      - function: "generateRandomUserData"
      - post:
          url: "/api/user/register"
          json: 
            username: "{{ username }}"
            email: "{{ email }}"
            first_name: "{{ firstname }}"
            last_name: "{{ lastname }}"
            password: "{{ password }}"
      - log: "Sent a request to /api/user/register with {{ username }}, {{ email }}, {{ password }}, {{ firstname }}, {{ lastname }}"